<a href="https://github.com/theonaunheim">
    <img style="border-radius: 100%; float: right;" src="static/strawberry_thief_square.png" width=10% alt="Theo Naunheim's Github">
</a>

<br style="clear: both">
<hr>
<br>

<h1 align='center'>Missing Data</h1>

<br>

<div style="display: table; width: 100%">
    <div style="display: table-row; width: 100%;">
        <div style="display: table-cell; width: 50%; vertical-align: middle;">
            <img src="static/empty_set.png">
        </div>
        <div style="display: table-cell; width: 10%">
        </div>
        <div style="display: table-cell; width: 40%; vertical-align: top;">
            <blockquote>
                    <p style="font-style: italic; color: white;">
                    "The devil's finest trick is to persuade you that he does not exist."
                    </p>
                    <br>
                    <p style="color: white;">-Charles Baudelaire</p>
            </blockquote>
        </div>
    </div>
</div>

<br>


<div align='left'>
    Image courtesy of <a href='https://commons.wikimedia.org/wiki/File:Empty_set.svg'>Octahedron80</a>, released into the public domain
</div>


<hr>

# Generally

Missing data is a fact of life. Consequently. pandas has good resources for dealing with it. Before we get to the tools and tactics available for dealing with missing data, a brief primer on NaNs, Nones, and Nulls:

<!--- The parentheisis at the end screws up typical markdown --->
### <a href="https://en.wikipedia.org/wiki/Null_(SQL)">Null</a>


Null (or NULL, or null) is a datatype in Structured Query Language (SQL) that signifies the absence of a value. It is not the same as zero (0), and it is not the same as an empty string (''). Nulls will generally be converted to something more Pythonic like NaN or None before you will work on it.

Example:

    SELECT 
        height 
    FROM
        table 
    WHERE
        height IS NOT NULL;

### [None](https://docs.python.org/3.6/library/constants.html#None)

None is Python's builtin datatype used to signify the absence of a value. You basically assign it to a variable like anything else. It is different than false, however please note bool(None) == False. 

Example:

    placeholder = None

### [NaN](https://docs.scipy.org/doc/numpy-1.13.0/user/misc.html)

NaN (not a number) is a datatype from numpy (numpy.NaN, often seen as np.NaN). It is [weird by design](https://en.wikipedia.org/wiki/NaN), but this weirdness allows for some pretty nifty workarounds. Two quick caveats: 1) numpy is technically a float and mixes best with other floats or Python objects; 2) if you are comparing something to NaN, use a specialized function for doing so. When tested for equality, np.NaN == np.NaN is false.

Related to NaN is NaT (not a time), which is like a NaN for datetime types.

Example:
    
    s = pandas.Series([np.NaN, 5.0, 1.0, np.NaN])

---

# Modules covered

### Standard Library
* None

### Third-Party Libraries
* [pandas](https://pandas.pydata.org/pandas-docs/stable/)
* [numpy](https://docs.scipy.org/doc/)


# Modules not covered

### Standard Library
* None

### Third-Party Libraries
* None

---

In [1]:
# Stdlib imports
import pathlib

# Third party imports
import numpy as np
import pandas as pd

### <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html">read_csv()</a> allows you to load your NaNs on import.

It will automatically pick up 'NA', 'N/A', '#N/A', '', 'NULL', 'null', 'NaN', 'nan', and a variety of other values by default. You can add your own custom NA values using the na_values argument.

In [2]:
# Example of what it looks like.
print(pathlib.Path('./data/disability.csv').read_text()[:500])

File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries  age 18-64
SSA-SA-FYWL.csv,11/10/2015,ATL,AL ,FY,2001,2760170,211792
CUSTOM_NULL_VALUE,11/10/2015,ATL,,FY,2002,2770228,223434
SSA-SA-FYWL.csv,,ATL,,FY,2003,2787370,232793
SSA-SA-FYWL.csv,11/10/2015,ATL,,FY,2004,,242764
SSA-SA-FYWL.csv,11/10/2015,ATL,,FY,2005,2824057,CUSTOM_NULL_VALUE
SSA-SA-FYWL.csv,11/10/2015,ATL,FL ,FY,2001,9792187,489839
SSA-SA-FYWL.csv,11/10/2015,ATL,,FY,2002,10019416

In [3]:
# And here's a more complete example.
df = pd.read_csv(
    './data/disability.csv',
    na_values=['CUSTOM_NULL_VALUE'],
    parse_dates=['Update Date'],
    infer_datetime_format=True,
)

# Floats are generally better than ints. Don't convert to int unless needed.
df.head(5)

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
0,SSA-SA-FYWL.csv,2015-11-10,ATL,AL,FY,2001,2760170.0,211792.0
1,NaN,2015-11-10,ATL,NaN,FY,2002,2770228.0,223434.0
2,SSA-SA-FYWL.csv,NaT,ATL,NaN,FY,2003,2787370.0,232793.0
3,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2004,NaN,242764.0
4,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2005,2824057.0,NaN

### <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html">drona()</a>

Both Series and DataFrames support the dropna() method. Unsurprisingly, this drops missing values.

In [4]:
# By default, dropna() will drop any row containing a NaN value.
df.dropna().head(5)

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
0,SSA-SA-FYWL.csv,2015-11-10,ATL,AL,FY,2001,2760170.0,211792.0
5,SSA-SA-FYWL.csv,2015-11-10,ATL,FL,FY,2001,9792187.0,489839.0
10,SSA-SA-FYWL.csv,2015-11-10,ATL,GA,FY,2001,5386624.0,264615.0
15,SSA-SA-FYWL.csv,2015-11-10,ATL,KY,FY,2001,2566411.0,235803.0
20,SSA-SA-FYWL.csv,2015-11-10,ATL,MS,FY,2001,1738726.0,151679.0

In [5]:
# Demonstating on a series as well. We will skip the Series examples going forward.
df['State Code'].dropna().head(5)

0     AL
5     FL
10    GA
15    KY
20    MS
Name: State Code, dtype: object

In [6]:
# Using the 'subset' arugment will allows you to drop only if specific columns or columns
# have NA values.
df.head(5)

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
0,SSA-SA-FYWL.csv,2015-11-10,ATL,AL,FY,2001,2760170.0,211792.0
1,NaN,2015-11-10,ATL,NaN,FY,2002,2770228.0,223434.0
2,SSA-SA-FYWL.csv,NaT,ATL,NaN,FY,2003,2787370.0,232793.0
3,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2004,NaN,242764.0
4,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2005,2824057.0,NaN

In [7]:
# Drop rows with NaN in 'Population age'
df.dropna(subset=['Population age 18-64']).head(5)

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
0,SSA-SA-FYWL.csv,2015-11-10,ATL,AL,FY,2001,2760170.0,211792.0
1,NaN,2015-11-10,ATL,NaN,FY,2002,2770228.0,223434.0
2,SSA-SA-FYWL.csv,NaT,ATL,NaN,FY,2003,2787370.0,232793.0
4,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2005,2824057.0,NaN
5,SSA-SA-FYWL.csv,2015-11-10,ATL,FL,FY,2001,9792187.0,489839.0

In [8]:
# Drop rows with NaN in 'Update Date' or 'State Code'
df.dropna(subset=['Update Date', 'State Code']).head(5)

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
0,SSA-SA-FYWL.csv,2015-11-10,ATL,AL,FY,2001,2760170.0,211792.0
5,SSA-SA-FYWL.csv,2015-11-10,ATL,FL,FY,2001,9792187.0,489839.0
10,SSA-SA-FYWL.csv,2015-11-10,ATL,GA,FY,2001,5386624.0,264615.0
15,SSA-SA-FYWL.csv,2015-11-10,ATL,KY,FY,2001,2566411.0,235803.0
20,SSA-SA-FYWL.csv,2015-11-10,ATL,MS,FY,2001,1738726.0,151679.0

### <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.fillna.html">fillna()</a>

Instead of dropping values, sometimes you will want to replace the NaN value or impute a value. This is what the fillna() function does. It can do a variety of different types of fills.

In [9]:
# This replaces all the NAs with zero.
df.fillna(0).head(5)

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
0,SSA-SA-FYWL.csv,2015-11-10 00:00:00,ATL,AL,FY,2001,2760170.0,211792.0
1,0,2015-11-10 00:00:00,ATL,0,FY,2002,2770228.0,223434.0
2,SSA-SA-FYWL.csv,0,ATL,0,FY,2003,2787370.0,232793.0
3,SSA-SA-FYWL.csv,2015-11-10 00:00:00,ATL,0,FY,2004,0.0,242764.0
4,SSA-SA-FYWL.csv,2015-11-10 00:00:00,ATL,0,FY,2005,2824057.0,0.0

In [10]:
# This replaces 'File Name' with unknown and 'Update Date' with NaT
df.fillna({'File Name': 'Unknown', 'Update Date': np.datetime64('NaT')}).head(5)

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
0,SSA-SA-FYWL.csv,2015-11-10,ATL,AL,FY,2001,2760170.0,211792.0
1,Unknown,2015-11-10,ATL,NaN,FY,2002,2770228.0,223434.0
2,SSA-SA-FYWL.csv,NaT,ATL,NaN,FY,2003,2787370.0,232793.0
3,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2004,NaN,242764.0
4,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2005,2824057.0,NaN

In [11]:
# It can get as complex as you want.
# Note: the nice thing is we can calculate column statistics without
# gettign rid of the NaN values first. See median usage below.
median_val = df['Population age 18-64'].median()
df['Population age 18-64'].fillna(median_val).head()

0    2760170.0
1    2770228.0
2    2787370.0
3    2778799.0
4    2824057.0
Name: Population age 18-64, dtype: float64

In [12]:
# It also has handy forward fill and backward fill options.
df['State Code'].fillna('').head(13)

0     AL
1
2
3
4
5     FL
6
7
8
9
10    GA
11
12
Name: State Code, dtype: object

In [13]:
# Forward fill
df['State Code'].fillna(method='ffill').head(13)

0     AL
1     AL
2     AL
3     AL
4     AL
5     FL
6     FL
7     FL
8     FL
9     FL
10    GA
11    GA
12    GA
Name: State Code, dtype: object

In [14]:
# Backfill fill
df['State Code'].fillna(method='bfill').head(13)

0     AL
1     FL
2     FL
3     FL
4     FL
5     FL
6     GA
7     GA
8     GA
9     GA
10    GA
11    KY
12    KY
Name: State Code, dtype: object

### <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.isnull.html">isnull()</a> /  <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.notnull.html">notnull()</a>

The pandas functions isnull() and notnull() are used to test whehter values are null, which allows for boolean indexing.

In [15]:
# View the head
df['State Code'].head(6)

0    AL
1    NaN
2    NaN
3    NaN
4    NaN
5    FL
Name: State Code, dtype: object

In [16]:
# Check whether null
null_mask = df['State Code'].head(6).isnull()
null_mask

0    False
1     True
2     True
3     True
4     True
5    False
Name: State Code, dtype: bool

In [17]:
# Get the rows with NA State Codes
df.head(6)[null_mask]

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
1,NaN,2015-11-10,ATL,NaN,FY,2002,2770228.0,223434.0
2,SSA-SA-FYWL.csv,NaT,ATL,NaN,FY,2003,2787370.0,232793.0
3,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2004,NaN,242764.0
4,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2005,2824057.0,NaN

In [18]:
# Check whether notnull
notnull_mask = df['State Code'].head(6).notnull()
notnull_mask

0     True
1    False
2    False
3    False
4    False
5     True
Name: State Code, dtype: bool

In [19]:
# Get the rows with valid state codes
df.head(6)[notnull_mask]

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
0,SSA-SA-FYWL.csv,2015-11-10,ATL,AL,FY,2001,2760170.0,211792.0
5,SSA-SA-FYWL.csv,2015-11-10,ATL,FL,FY,2001,9792187.0,489839.0

In [20]:
# Note, you can also negate the mask with the negation operator ~
df.head(6)[~notnull_mask]

,File Name,Update Date,Region Code,State Code,Date Type,Date,Population age 18-64,SSA Disabilty Beneficiaries age 18-64
1,NaN,2015-11-10,ATL,NaN,FY,2002,2770228.0,223434.0
2,SSA-SA-FYWL.csv,NaT,ATL,NaN,FY,2003,2787370.0,232793.0
3,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2004,NaN,242764.0
4,SSA-SA-FYWL.csv,2015-11-10,ATL,NaN,FY,2005,2824057.0,NaN

### Np.NaN as a placeholder

In [21]:
# Creating empty data columns
df = pd.DataFrame({'x': np.arange(10) * 7, 'y': np.NaN})
df

    x   y
0   0 NaN
1   7 NaN
2  14 NaN
3  21 NaN
4  28 NaN
5  35 NaN
6  42 NaN
7  49 NaN
8  56 NaN
9  63 NaN

In [22]:
df.loc[df['x'] < 30, 'y'] = 'I am less than 30!'
df.loc[df['x'] >= 30, 'y'] = 'I am 30 or greater!'
df

    x                    y
0   0   I am less than 30!
1   7   I am less than 30!
2  14   I am less than 30!
3  21   I am less than 30!
4  28   I am less than 30!
5  35  I am 30 or greater!
6  42  I am 30 or greater!
7  49  I am 30 or greater!
8  56  I am 30 or greater!
9  63  I am 30 or greater!

# Additional Learing Resources

* ### [Pandas Missing Data Tutorial](https://pandas.pydata.org/pandas-docs/stable/missing_data.html)

---

# Next Up: [Dtype Specific Techniques](4_dtype_specific_techniques.ipynb)

<br>

<div align='left'>

<img style="margin-left: 0;" src="./static/my_kingdom_for_a_decent_data_type_image.png" width="200">


<br>

Image courtesy of <a href='https://commons.wikimedia.org/wiki/File:Binario_cropped.png'>MdeVicente</a>, released into the public domain.
</div>


---